In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [0]:
#df = pd.read_csv('http://web.mta.info/developers/data/nyct/turnstile/turnstile_180505.txt')
df1 = pd.read_csv('http://web.mta.info/developers/data/nyct/turnstile/turnstile_190427.txt')
df2 = pd.read_csv('http://web.mta.info/developers/data/nyct/turnstile/turnstile_190504.txt')
df3 = pd.read_csv('http://web.mta.info/developers/data/nyct/turnstile/turnstile_190511.txt')

In [3]:
print(len(df1) + len(df2) + len(df3))
print(len(df2))
print(len(df3))

614802
206857
204088

In [0]:
df = df1.append([df2, df3])

In [5]:
len(df)

614802

In [0]:
df.columns = df.columns.str.strip()

In [7]:
df.tail()

          C/A  UNIT       SCP        STATION  ...      TIME     DESC ENTRIES EXITS
204083  TRAM2  R469  00-05-01  RIT-ROOSEVELT  ...  05:00:00  REGULAR    5554   376
204084  TRAM2  R469  00-05-01  RIT-ROOSEVELT  ...  09:00:00  REGULAR    5554   376
204085  TRAM2  R469  00-05-01  RIT-ROOSEVELT  ...  13:00:00  REGULAR    5554   376
204086  TRAM2  R469  00-05-01  RIT-ROOSEVELT  ...  17:00:00  REGULAR    5554   376
204087  TRAM2  R469  00-05-01  RIT-ROOSEVELT  ...  21:00:00  REGULAR    5554   376

[5 rows x 11 columns]

In [0]:
# Create DATETIME column and convert string to datetime object

df['DATETIME'] = df['DATE'] + ' ' + df['TIME']
df['DATETIME'] = pd.to_datetime(df['DATETIME'], format="%m/%d/%Y %H:%M:%S")
df.drop(columns=['DATE', 'TIME'], inplace=True)

In [0]:
df['DAY'] = df['DATETIME'].dt.day_name()

In [10]:
df.head()

    C/A  UNIT       SCP STATION  ...  ENTRIES    EXITS            DATETIME       DAY
0  A002  R051  02-00-00   59 ST  ...  7026702  2382234 2019-04-20 00:00:00  Saturday
1  A002  R051  02-00-00   59 ST  ...  7026719  2382240 2019-04-20 04:00:00  Saturday
2  A002  R051  02-00-00   59 ST  ...  7026737  2382269 2019-04-20 08:00:00  Saturday
3  A002  R051  02-00-00   59 ST  ...  7026814  2382335 2019-04-20 12:00:00  Saturday
4  A002  R051  02-00-00   59 ST  ...  7027007  2382395 2019-04-20 16:00:00  Saturday

[5 rows x 11 columns]

In [0]:


df['ENTRY COUNT'] = df.groupby(['UNIT', 'SCP'])['ENTRIES'].transform(lambda x: x.diff())
df['EXIT COUNT'] = df.groupby(['UNIT', 'SCP'])['EXITS'].transform(lambda x: x.diff())

In [12]:
df['EXIT COUNT'].describe()

count    6.099380e+05
mean     1.860043e+03
std      3.064132e+06
min     -1.359348e+09
25%      8.000000e+00
50%      5.100000e+01
75%      1.620000e+02
max      1.078346e+09
Name: EXIT COUNT, dtype: float64

In [0]:
df = df[(df['ENTRY COUNT'] >= 0) & (df['EXIT COUNT'] >= 0)]

In [14]:
df.describe()

            ENTRIES         EXITS   ENTRY COUNT    EXIT COUNT
count  6.026730e+05  6.026730e+05  6.026730e+05  6.026730e+05
mean   2.786367e+07  2.016885e+07  6.446536e+03  6.742399e+03
std    1.588909e+08  1.360172e+08  2.110708e+06  2.269092e+06
min    0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00
25%    3.366980e+05  1.389650e+05  1.000000e+01  8.000000e+00
50%    2.121450e+06  1.207749e+06  7.200000e+01  5.100000e+01
75%    6.466613e+06  4.418113e+06  2.350000e+02  1.640000e+02
max    2.115823e+09  2.037820e+09  1.126553e+09  1.078346e+09

In [15]:
len(df)
df['ENTRY COUNT'].max()

1126552843.0

In [16]:
df.describe()

            ENTRIES         EXITS   ENTRY COUNT    EXIT COUNT
count  6.026730e+05  6.026730e+05  6.026730e+05  6.026730e+05
mean   2.786367e+07  2.016885e+07  6.446536e+03  6.742399e+03
std    1.588909e+08  1.360172e+08  2.110708e+06  2.269092e+06
min    0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00
25%    3.366980e+05  1.389650e+05  1.000000e+01  8.000000e+00
50%    2.121450e+06  1.207749e+06  7.200000e+01  5.100000e+01
75%    6.466613e+06  4.418113e+06  2.350000e+02  1.640000e+02
max    2.115823e+09  2.037820e+09  1.126553e+09  1.078346e+09

In [17]:
len(df)

604488

In [17]:
df = df[(df['ENTRY COUNT'] < 15000) & (df['EXIT COUNT'] < 15000)]
df.describe()

            ENTRIES         EXITS    ENTRY COUNT     EXIT COUNT
count  6.026360e+05  6.026360e+05  602636.000000  602636.000000
mean   2.785908e+07  2.016344e+07     172.095854     135.882961
std    1.588826e+08  1.360033e+08     251.462361     233.056615
min    0.000000e+00  0.000000e+00       0.000000       0.000000
25%    3.367968e+05  1.389408e+05      10.000000       8.000000
50%    2.121494e+06  1.207656e+06      72.000000      51.000000
75%    6.466618e+06  4.417960e+06     235.000000     164.000000
max    2.115823e+09  2.037820e+09   13759.000000    9407.000000

In [18]:
df.head()

    C/A  UNIT       SCP  ...       DAY ENTRY COUNT EXIT COUNT
1  A002  R051  02-00-00  ...  Saturday        17.0        6.0
2  A002  R051  02-00-00  ...  Saturday        18.0       29.0
3  A002  R051  02-00-00  ...  Saturday        77.0       66.0
4  A002  R051  02-00-00  ...  Saturday       193.0       60.0
5  A002  R051  02-00-00  ...  Saturday       286.0       32.0

[5 rows x 13 columns]

In [0]:
final = df.groupby(['STATION', 'LINENAME']).agg({'ENTRY COUNT' : 'sum', 'EXIT COUNT' : 'sum'})

In [20]:
final.reset_index(inplace=True)
final.head()

         STATION LINENAME  ENTRY COUNT  EXIT COUNT
0           1 AV        L     322649.0    369205.0
1         103 ST        1     238151.0    116084.0
2         103 ST        6     237259.0    214588.0
3         103 ST       BC      89107.0     61951.0
4  103 ST-CORONA        7     370041.0    268830.0

In [21]:
final.sort_values('ENTRY COUNT', ascending=False).head(10)

             STATION      LINENAME  ENTRY COUNT  EXIT COUNT
311  GRD CNTRL-42 ST         4567S    2639828.0   2326228.0
89   34 ST-HERALD SQ      BDFMNQRW    2129151.0   2011772.0
93    34 ST-PENN STA           ACE    1527514.0   1383212.0
102  42 ST-PORT AUTH  ACENQRS1237W    1439824.0   1209977.0
27    14 ST-UNION SQ      LNQR456W    1330276.0   1199564.0
446   TIMES SQ-42 ST  1237ACENQRSW    1261544.0   1207689.0
301        FULTON ST      2345ACJZ    1103759.0   1089165.0
125   59 ST COLUMBUS         ABCD1    1099081.0    908617.0
106   47-50 STS ROCK          BDFM    1064730.0   1099616.0
402     PATH NEW WTC             1     956183.0    864703.0

In [0]:
top = final.sort_values('EXIT COUNT', ascending=False).head(20)

In [24]:
top

             STATION      LINENAME  ENTRY COUNT  EXIT COUNT
311  GRD CNTRL-42 ST         4567S    2639828.0   2326228.0
89   34 ST-HERALD SQ      BDFMNQRW    2129151.0   2011772.0
93    34 ST-PENN STA           ACE    1527514.0   1383212.0
102  42 ST-PORT AUTH  ACENQRS1237W    1439824.0   1209977.0
446   TIMES SQ-42 ST  1237ACENQRSW    1261544.0   1207689.0
27    14 ST-UNION SQ      LNQR456W    1330276.0   1199564.0
106   47-50 STS ROCK          BDFM    1064730.0   1099616.0
301        FULTON ST      2345ACJZ    1103759.0   1089165.0
125   59 ST COLUMBUS         ABCD1    1099081.0    908617.0
402     PATH NEW WTC             1     956183.0    864703.0
288    FLUSHING-MAIN             7     913588.0    775152.0
156            86 ST           456     722570.0    764609.0
92    34 ST-PENN STA        123ACE     885450.0    764064.0
458   W 4 ST-WASH SQ       ABCDEFM     831692.0    759093.0
354  LEXINGTON AV/53           EM6     697759.0    743984.0
121            59 ST       456NQRW     718898.0    741286.0
338  JKSN HT-ROOSVLT         EFMR7     942908.0    700850.0
164            96 ST           123     669533.0    661754.0
91    34 ST-PENN STA           123     632692.0    659708.0
234         CANAL ST       JNQRZ6W     852563.0    626797.0

In [25]:
type(top)

pandas.core.frame.DataFrame